Tekla Open API Reference for Tekla Structures 2025
AnalysisBar Properties
The AnalysisBar type exposes the following members.
Properties
Name | Description
AnalysisDesignCode
 Gets or sets the analysis design code of the analysis bar.
AnalysisModelName
 Gets or sets the analysis model name.
 (Inherited from AnalysisObject.)
AnalysisObjectType
 Gets or sets the type of the analysis object.
 (Inherited from AnalysisObject.)
AnalysisType
 Gets or sets the analysis type of the analysis bar.
CardinalPoint
 Gets or sets the cardinal point of the analysis bar.
Composite
 Gets or sets the composite beam of the analysis bar.
Curvature
 Gets or sets the curvature of the analysis bar.
FatherObject2ID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObject2Type
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
FatherObjectID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObjectType
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
ID
 Gets or sets the identifier of the analysis object.
 (Inherited from AnalysisObject.)
Label
 Gets or sets the label of the analysis bar.
Material
 Gets or sets the material of the analysis bar.
Members
 Gets the members of the analysis bar.
Positions
 Gets the positions of the analysis bar.
ProfileEnd
 Gets or sets the end profile of the analysis bar.
ProfileStart
 Gets or sets the start profile of the analysis bar.
Top
See Also
Reference
AnalysisBar Class
Tekla.Structures.Analysis Namespace